src/cf/Documents/ЗаявкаНаОтпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОтпуск</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассмотрения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ЗаявкаНаОтпуск/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика   
	
	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ТекПользователь = ПользователиСлужебный.АвторизованныйПользователь();
		Объект.Сотрудник =  ТекПользователь.Сотрудник;  
	КонецЕсли;
	
	Период.ДатаНачала =  Объект.ДатаНачала;
	Период.ДатаОкончания =  Объект.ДатаОкончания;   
	
	Элементы.ОтправитьНаСогласование.Доступность = Не Объект.Согласован;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент) 
	
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;  
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСогласованиеНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СогласованиеОтпуска.Ссылка КАК Ссылка,
		|	СогласованиеОтпуска.Стартован КАК Стартован,
		|	СогласованиеОтпуска.Завершен КАК Завершен
		|ИЗ
		|	БизнесПроцесс.СогласованиеОтпуска КАК СогласованиеОтпуска
		|ГДЕ
		|	СогласованиеОтпуска.ДокументНаСогласование = &ДокументНаСогласование";
	
	
	Запрос.УстановитьПараметр("ДокументНаСогласование",Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Бп = БизнесПроцессы.СогласованиеОтпуска.СоздатьБизнесПроцесс();
	ИначеЕсли Выборка.Следующий() Тогда
		Если Выборка.Завершен Тогда
			Бп = БизнесПроцессы.СогласованиеОтпуска.СоздатьБизнесПроцесс();
		ИначеЕсли НЕ Выборка.Стартован Тогда
			Бп = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			Возврат;
		КонецЕсли;    
	Иначе
		Возврат;
	КонецЕсли;
	
    Бп.Дата = ТекущаяДатаСеанса();
    Бп.Инициатор = ПользователиСлужебный.АвторизованныйПользователь();
    
    Бп.Сотрудник = Объект.Согласующий;    
    Бп.ДокументНаСогласование = Объект.Ссылка;
    
    Бп.Записать();
    Бп.Старт();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	ОтправитьНаСогласованиеНаСервере();
КонецПроцедуры
